export const experiences = [
    {
        id: 1,
        time: "2014年9月",
        content: `
            大學就學 4 年間參加網球社，擔任 2 年教學，指導 15人以上的新手從零基礎到參加校際盃，並獲得校際盃冠軍。
            在氣象組與同學合作持續半年每週製作每日氣溫、降雨預報共24則，準確度相當於氣象局，獲教授肯定。
        `,
    },
    {
        id: 2,
        time: "2019年1月",
        content: `
            簽志願役，加入儀隊工作 2 年多，主要負責紀錄、整理連隊100多人的訓練及體能狀況，
            並協助每年雙十、元旦的後勤支援及國家級元首到訪時的總統府前場地佈置。
        `,
    },
    {
        id: 3,
        time: "2021年9月",
        content: `
開始嘗試以 C 入門，掌握基礎變數宣告、迴圈、位址...等，
又以 python 作為練習 leetcode 的工具，在接觸到前端後，發現我對這種「所寫即所見」的模式相當有興趣，因此決心成為前端工程師。
        `,
    },
    {
        id: 4,
        time: "2022年3月",
        content: `
參加資策會前端工程師養成班，結訓前與 8 人小組合作，以 React、Node 及 MySQL 開發咖啡店商網站，
並於課餘時間自學 Vue options / composition API。
        `,
    },
    {
        id: 5,
        time: "2022年10月",
        content: `
   在緯穎科技服務股份有限公司擔任前端工程師，期間，負責多個關鍵專案的開發與重構工作。
成功將舊專案導入TypeScript與Redux-Toolkit，並升級Webpack版本，顯著提升了團隊開發效率與程式碼品質。
針對內部系統，運用AG-Grid與Socket重構了預算填寫系統，並利用Chart.js實現了資料視覺化與多人線上共編功能。
此外，亦開發了多個React與React Native應用程式，包括工廠排程系統、採購自動下單系統及供應商模具盤點App，擁有網頁、手機、電腦桌面應用程式，三種平台的開發經驗。
        `,
    },
];
