export const experiences = [
    {
        id: 1,
        time: "2014年9月",
        content: `
            大學就學 4 年間參加網球社，擔任 2 年教學長，指導 15人以上的新手從零基礎到參加校際盃，並獲得校際盃冠軍。
            在氣象組與同學合作持續半年每週製作每日氣溫、降雨預報共24則，準確度略優於氣象局，獲教授肯定。
        `,
    },
    {
        id: 2,
        time: "2019年1月",
        content: `
            簽志願役，加入儀隊工作 2 年多，主要負責紀錄、整理連隊100多人的訓練及體能狀況，
            並協助每年雙十、元旦的後勤支援及國家級元首到訪時的總統府前場地佈置。
        `,
    },
    {
        id: 3,
        time: "2021年9月",
        content: `
            儀隊工作內容較為單調，無法帶給我成就感，經身為軟體工程師的妹妹鼓勵下，
            決定轉換跑道，嘗試摸索幾種不同程式語言，以 C 入門，掌握基礎變數宣告、迴圈、位址...等，
            又以 python 作為練習 leetcode 的工具，在接觸到前端後，發現我對這種「所寫即所見」的模式相當有興趣，
            因此決心成為前端工程師。
        `,
    },
    {
        id: 4,
        time: "2022年3月",
        content: `
            參加資策會前端工程師養成班，結訓前與 8 人小組合作，以 React、Node 及 MySQL 開發咖啡店商網站，
            也在課餘時間跟著 Vue 的官方文件學習 options / composition API。
        `,
    },
];
